# QTM 385

> Data Science with Pandas 1

# Data Science with Pandas

Now we start our Data Science in Python part of the course. As you know the programming language structure, you will see that it is much easier to get things done using custom packages.

## Load Pandas

Load pandas is very easy. Provided that the package is installed (if not, check [here](https://pandas.pydata.org/pandas-docs/stable/getting_started/install.html) how to install it), type:

In [1]:
# My code here
import pandas as pd

And now, pandas is loaded.

## Load Data into Python

To start having fun, we need to load data into Python. We can do this in three ways: 
1. from a local file, 
2. from the internet, and 
3. from data typed in the keyboard.

### From Locale

First, we need to find the working directory. To do that, we need to use the library `os`. To do this you need to:

```
import os
print(os.getcwd())
```

Then, you need to put the file in the folder. If you need to change the folder, use the function:

```
os.chdir("new_path_here")
```

Now that we know the folder, and the file is there, we can load it:

```
dat = pd.read_csv('file_name_here.csv')
```

Here I will load CSV files, but Pandas has the ability to load files from other formats, such as Excel, SPSS, R, and others.

In [3]:
import os

In [12]:
print(os.getcwd())
# os.chdir('/Users/laurengalindo/QTM 385-5') --- Keeping all my work in this folder

/Users/laurengalindo/QTM 385-5

### From the internet

The way we will load here is from the internet. 

For example, suppose the following dataset: https://raw.githubusercontent.com/umbertomig/qtm150/master/datasets/PErisk.csv.

To open, we use the `read_csv` command as we did with the locale version.

In [18]:
# My code here
dat = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm150/master/datasets/PErisk.csv')
dat.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

The method `.head()` is implemented on the dataset, even though its from the internet

Python starts counting at 0

### From typing in the keyboard

We can also build a dataset from scratch.

For example, we could build a simple dataset in the following way:

```
dat = pd.DataFrame({
    "v1": ['d1', 'd2', 'd3'],
    "v2": [1, 2, 3],
    "v3": ['A', 'B', 'A'],
    "v4": [2.0, 1.1, 2.2]})
```

And this works for small datasets, with the inconvenience of having to type.

In [35]:
dat2 = pd.DataFrame({
    "var1": [1,2,3],
    "var2": ['a', 'b', 'c']
})

In [39]:
dat2.head()

   var1 var2
0     1    a
1     2    b
2     3    c

## Dataset Information

Suppose we have a pandas dataset called `dat`. To make it more realistic, use the following example:

```
# For me: PErisk
dat = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm150/master/datasets/PErisk.csv')

# For you: tips
dat2 = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm151/main/datasets/tips.csv')
```

If you are having VPN issues, I put the data on Canvas, so you can download it and load from your own computer.

In [40]:
# PErisk
dat = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm150/master/datasets/PErisk.csv')

# tips
dat2 = pd.read_csv('https://raw.githubusercontent.com/umbertomig/qtm151/main/datasets/tips.csv')

In [41]:
# PErisk
#dat.head()

# tips
dat2.head()

   obs  totbill   tip sex smoker  day   time  size
0    1    16.99  1.01   F     No  Sun  Night     2
1    2    10.34  1.66   M     No  Sun  Night     3
2    3    21.01  3.50   M     No  Sun  Night     3
3    4    23.68  3.31   M     No  Sun  Night     2
4    5    24.59  3.61   F     No  Sun  Night     4

### .info(.)

This method prints the information about the content of a dataset.

Syntax and Usage: `print(dat.info())`

* Class : Pandas DataFrame
* Range Index : entries numbered from 0 to 243 for a total of 244 entries
* Memory usage : how much memory gets used
* Non-Null count : How many are NAs? If the number is the same as the number of entries, then there are 0 NAs
* dtypes: what kind of variables each is

In [42]:
# My code here
dat2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   obs      244 non-null    int64
 1   totbill  244 non-null    float64
 2   tip      244 non-null    float64
 3   sex      244 non-null    object
 4   smoker   244 non-null    object
 5   day      244 non-null    object
 6   time     244 non-null    object
 7   size     244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB

### .head(.)

This method prints the first few observations of the dataset.

Syntax and Usage: `print(dat.head())`

In [54]:
# My code here
print(dat.head(), '\n\n')
print(dat2.head())

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120


   obs  totbill   tip sex smoker  day   time  size
0    1    16.99  1.01   F     No  Sun  Night     2
1    2    10.34  1.66   M     No  Sun  Night     3
2    3    21.01  3.50   M     No  Sun  Night     3
3    4    23.68  3.31   M     No  Sun  Night     2
4    5    24.59  3.61   F     No  Sun  Night     4

### .shape

This prints the number of rows and columns of a dataset.

Syntax and Usage: `print(dat.shape)`

Note: no parenthesis necessary.

In [51]:
# My code here
print(dat.shape)
print(dat2.shape)

(62, 6)
(244, 8)

### .describe(.)

This method gives us a few summary statistics of the dataset.

Syntax and Usage: `print(dat.describe())`

In [57]:
# My code here
print(dat.describe(), '\n\n')
dat2.describe()

          courts      barb2    prsexp2   prscorr2      gdpw2
count  62.000000  62.000000  62.000000  62.000000  62.000000
mean    0.451613  -2.925557   3.274194   2.532258   9.041875
std     0.501716   2.707211   1.369089   1.501013   0.970264
min     0.000000  -6.907755   0.000000   0.000000   7.029973
25%     0.000000  -4.894882   3.000000   1.250000   8.381027
50%     0.000000  -2.353233   3.000000   2.000000   9.185412
75%     1.000000  -1.301007   4.000000   4.000000   9.889280
max     1.000000   2.337425   5.000000   5.000000  10.410180

              obs     totbill         tip        size
count  244.000000  244.000000  244.000000  244.000000
mean   122.500000   19.785943    2.998279    2.569672
std     70.580923    8.902412    1.383638    0.951100
min      1.000000    3.070000    1.000000    1.000000
25%     61.750000   13.347500    2.000000    2.000000
50%    122.500000   17.795000    2.900000    2.000000
75%    183.250000   24.127500    3.562500    3.000000
max    244.000000   50.810000   10.000000    6.000000

**Note: We have 6 variables in dat, but describe only displays 5. This is because the excluded variables are strings and you cant do descriptive stats on these.**

### .values

This prints the observations in the dataset.

Syntax and Usage: `print(dat.values)`

Note: no parenthesis necessary.

In [67]:
# My code here
dat.values

dat2.values # If you have a huge dataset, this will take hours to display
# This is how the observations are stored in the memory
# Truncates the dataset becasue it is so large

array([[1, 16.99, 1.01, ..., 'Sun', 'Night', 2],
       [2, 10.34, 1.66, ..., 'Sun', 'Night', 3],
       [3, 21.01, 3.5, ..., 'Sun', 'Night', 3],
       ...,
       [242, 22.67, 2.0, ..., 'Sat', 'Night', 2],
       [243, 17.82, 1.75, ..., 'Sat', 'Night', 2],
       [244, 18.78, 3.0, ..., 'Thu', 'Night', 2]], dtype=object)

### .columns

This prints the variables information of the dataset.

Syntax and Usage: `print(dat.columns)`

Note: no parenthesis necessary.

In [71]:
# dat
print(dat.columns)

# dat2
print(dat2.columns)

Index(['country', 'courts', 'barb2', 'prsexp2', 'prscorr2', 'gdpw2'], dtype='object')
Index(['obs', 'totbill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

### .index

This prints informations about the dataset rows.

Syntax and Usage: `print(dat.index)`

Note: no parenthesis necessary.

In [74]:
# My code here
print(dat.index)

RangeIndex(start=0, stop=62, step=1)

**Exercise**: Run the same examples for the dataset `dat2`

In [75]:
## Your answers here!
print(dat2.index)

RangeIndex(start=0, stop=244, step=1)

## Data Manipulation

### Subsetting variables (columns)

To subset variables the sintax is simple. When it is only one variable:

```
dat["var_name"]
```

When it is two or more, you need to enclose them in a list:

```
dat[["var1", "var2"]]
```

In [84]:
# Lets check what variables we can work with
print(dat.columns, '\n')

# List first 5 countries in this dataset
print(dat['country'].head(), '\n')

# Display the 24th country in the dataset
print(dat['country'][23])

Index(['country', 'courts', 'barb2', 'prsexp2', 'prscorr2', 'gdpw2'], dtype='object')

0     Argentina
1     Australia
2       Austria
3    Bangladesh
4       Belgium
Name: country, dtype: object

Hungary

In [88]:
# Select only the variables we want
dat[['country', 'gdpw2']].head()

      country      gdpw2
0   Argentina   9.690170
1   Australia  10.304840
2     Austria  10.100940
3  Bangladesh   8.379768
4     Belgium  10.250120

In [96]:
# Select 1 variable from dat2
print(dat2[['totbill']], '\n')

# Select 2 variables from dat2
print(dat2[['totbill', 'smoker']])

     totbill
0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
..       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78

[244 rows x 1 columns]

     totbill smoker
0      16.99     No
1      10.34     No
2      21.01     No
3      23.68     No
4      24.59     No
..       ...    ...
239    29.03     No
240    27.18    Yes
241    22.67    Yes
242    17.82     No
243    18.78     No

[244 rows x 2 columns]

When you subset more than one, you need to use lists

### Subsetting cases (rows)

Now, to work with cases, notice that pandas allows us to do vectorized operations. For instance:

```
dat["var_name"] > some_number
```

Returns True, if the variable is greater than the number, and False otherwise. To subset the dataset, you need to:

```
dat[dat["var_name"] > some_number]
```

And that's it! For multiple comparisons, the syntax is also easy to use:

```
dat[ (dat["v1"] == "some_value") & (dat["v2"] == "some_other_value") ]
```

And if we want a command similar to `%in%` in R, we can use the `.isin(.)` method:

```
dat[ dat["v1"].isin(["some_value", "some_other_value"]) ]
```

In [116]:
    # Show if there are courts in dat
dat['courts']

    # Making a boolean vector
dat['courts'] == 1


# LOGICAL OPERATIONS:

    # Filtering by courts = 1
dat[dat['courts'] == 1]

    # Filtering by gdpw2 > 10
dat[dat['gdpw2']>10]

    # Using .isin(.)
dat[(dat['courts']==1) & (dat['gdpw2']>10) & (dat['prsexp2'].isin([3, 4]))]

   country  courts     barb2  prsexp2  prscorr2     gdpw2
29   Italy       1 -6.907755        4         3  10.26078
50  Sweden       1 -6.907755        4         5  10.22434

**Exercise**: Filter the `tips` dataset (our `dat2`) by:

1. Bills of more than 10 dollars
2. Smokers
3. Weekend

Do each of these separately, then do all together.

In [145]:
## Your answers here!

# Bills of more than $10
dat2[dat2['totbill']>10].head()

   obs  totbill   tip sex smoker  day   time  size
0    1    16.99  1.01   F     No  Sun  Night     2
1    2    10.34  1.66   M     No  Sun  Night     3
2    3    21.01  3.50   M     No  Sun  Night     3
3    4    23.68  3.31   M     No  Sun  Night     2
4    5    24.59  3.61   F     No  Sun  Night     4

In [144]:
# Smokers
dat2[dat2['smoker'] == 'Yes'].head()

    obs  totbill   tip sex smoker  day   time  size
56   57    38.01  3.00   M    Yes  Sat  Night     4
58   59    11.24  1.76   M    Yes  Sat  Night     2
60   61    20.29  3.21   M    Yes  Sat  Night     2
61   62    13.81  2.00   M    Yes  Sat  Night     2
62   63    11.02  1.98   M    Yes  Sat  Night     2

In [143]:
# Weekend 
dat2[dat2['day'].isin(['Sat', 'Sun'])].head()

   obs  totbill   tip sex smoker  day   time  size
0    1    16.99  1.01   F     No  Sun  Night     2
1    2    10.34  1.66   M     No  Sun  Night     3
2    3    21.01  3.50   M     No  Sun  Night     3
3    4    23.68  3.31   M     No  Sun  Night     2
4    5    24.59  3.61   F     No  Sun  Night     4

In [142]:
# All together
dat2[(dat2['totbill']>10) & (dat2['smoker'] == 'Yes') & (dat2['day'].isin(['Sat', 'Sun']))].head()

    obs  totbill   tip sex smoker  day   time  size
56   57    38.01  3.00   M    Yes  Sat  Night     4
58   59    11.24  1.76   M    Yes  Sat  Night     2
60   61    20.29  3.21   M    Yes  Sat  Night     2
61   62    13.81  2.00   M    Yes  Sat  Night     2
62   63    11.02  1.98   M    Yes  Sat  Night     2

### Simple computations

It is simple to create new variables from older ones.

```
# Summing two variables
dat["my_new_var"] = dat["my_old_var1"] + dat["my_old_var2"]

# Multiplying by a constant
dat["my_new_var"] = dat["my_old_var1"] * constant

# Apply some numpy function (try to always use numpy functions, as pandas is based on numpy)
import numpy as np
dat["my_new_logged_var"] = np.log(dat["my_old_var"])
```

In [146]:
# My code here
dat.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2
0   Argentina       0 -0.720775        1         3   9.690170
1   Australia       1 -6.907755        5         4  10.304840
2     Austria       1 -4.910337        5         4  10.100940
3  Bangladesh       0  0.775975        1         0   8.379768
4     Belgium       1 -4.617344        5         4  10.250120

In [148]:
# Creating risk variable
dat['risk'] = 10 - dat['prsexp2'] - dat['prscorr2']
dat.head()

      country  courts     barb2  prsexp2  prscorr2      gdpw2  risk
0   Argentina       0 -0.720775        1         3   9.690170     6
1   Australia       1 -6.907755        5         4  10.304840     1
2     Austria       1 -4.910337        5         4  10.100940     1
3  Bangladesh       0  0.775975        1         0   8.379768     9
4     Belgium       1 -4.617344        5         4  10.250120     1

In [149]:
import numpy as np

In [151]:
dat['gdppc'] = np.exp(dat['gdpw2'])
dat.head()
dat.describe()

,courts,barb2,prsexp2,prscorr2,gdpw2,risk,gdppc
count,62.000000,62.000000,62.000000,62.000000,62.000000,62.000000,62.000000
mean,0.451613,-2.925557,3.274194,2.532258,9.041875,4.193548,12378.127151
std,0.501716,2.707211,1.369089,1.501013,0.970264,2.654033,9529.332077
min,0.000000,-6.907755,0.000000,0.000000,7.029973,0.000000,1130.000100
25%,0.000000,-4.894882,3.000000,1.250000,8.381027,2.250000,4363.498311
50%,0.000000,-2.353233,3.000000,2.000000,9.185412,4.500000,9754.001199
75%,1.000000,-1.301007,4.000000,4.000000,9.889280,6.000000,19717.994073
max,1.000000,2.337425,5.000000,5.000000,10.410180,10.000000,33195.845117

**Exercise**: In the `tips` dataset, create the variable `prop_tip`, which is the proportion of the tip with relation to the total bill.

In [158]:
## Your answers here!
dat2['prop_tip'] = dat2['tip']/dat2['totbill']

dat2.describe()

              obs     totbill         tip        size    prop_tip
count  244.000000  244.000000  244.000000  244.000000  244.000000
mean   122.500000   19.785943    2.998279    2.569672    0.160803
std     70.580923    8.902412    1.383638    0.951100    0.061072
min      1.000000    3.070000    1.000000    1.000000    0.035638
25%     61.750000   13.347500    2.000000    2.000000    0.129127
50%    122.500000   17.795000    2.900000    2.000000    0.154770
75%    183.250000   24.127500    3.562500    3.000000    0.191475
max    244.000000   50.810000   10.000000    6.000000    0.710345

## Statistics

We can easily compute statistics from the data. Here are a few methods that we have available:

| Method           | Description                  |
|------------------|------------------------------|
| `.median()`      | Median                       |
| `.mean()`        | Mean                         |
| `.min()`         | Minimum                      |
| `.max()`         | Maximum                      |
| `.var()`         | Variance                     |
| `.std()`         | Standard Deviation           |
| `.sum()`         | Sum values                   |
| `.mode()`        | More frequent values         |
| `.quantile(val)` | Quantile value (btw 0 and 1) |

In [171]:
# My code here
dat['gdppc'].mean()
dat['gdppc'].quantile(.1) 
    #10% of countries have GDP below 2052.20

2052.199573919149

**Exercise**: For the `tips` dataset:

1. Compute the mean and median of tip
2. Compute the mode of day
3. Compute the first quartile of the totbill.

In [163]:
## Your answers here!
dat2['tip'].mean(), dat2['tip'].median(), dat2['day'].mode()

(2.9982786885245902,
 2.9,
 0    Sat
 dtype: object)

**Great job!!!**